In [1]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

In [2]:
airline_file = "Data/airlines.csv"
airline_df = pd.read_csv(airline_file)
airline_df.head()

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N

In [3]:
airline_clean_df = airline_df[["Airline ID", "Name", "ICAO", "Country", "Active"]]
airline_clean_df = airline_clean_df.rename(columns = {"Name": "Operator"})
airline_clean_df

,Airline ID,Operator,ICAO,Country,Active
0,-1,Unknown,NaN,\N,Y
1,1,Private flight,NaN,NaN,Y
2,2,135 Airways,GNL,United States,N
3,3,1Time Airline,RNX,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,WYT,United Kingdom,N
...,...,...,...,...,...
6157,21248,GX Airlines,CBG,China,Y
6158,21251,Lynx Aviation (L3/SSX),SSX,United States,N
6159,21268,Jetgo Australia,\N,Australia,Y
6160,21270,Air Carnival,\N,India,Y
6161,21317,Svyaz Rossiya,SJM,Russia,Y

In [4]:
# Changing the name of Aeroflot Russian Airlines to Aeroflot
airline_clean_df = airline_clean_df.set_index('Operator')
airline_clean_df = airline_clean_df.rename(index={'Aeroflot Russian Airlines': 'Aeroflot',
                                      'Avianca - Aerovias Nacionales de Colombia': 'Avianca'})

airline_clean_df

,Airline ID,ICAO,Country,Active
Operator,,,,
Unknown,-1,NaN,\N,Y
Private flight,1,NaN,NaN,Y
135 Airways,2,GNL,United States,N
1Time Airline,3,RNX,South Africa,Y
2 Sqn No 1 Elementary Flying Training School,4,WYT,United Kingdom,N
...,...,...,...,...
GX Airlines,21248,CBG,China,Y
Lynx Aviation (L3/SSX),21251,SSX,United States,N
Jetgo Australia,21268,\N,Australia,Y
Air Carnival,21270,\N,India,Y
Svyaz Rossiya,21317,SJM,Russia,Y

In [5]:
airline_clean_df.reset_index()

,Operator,Airline ID,ICAO,Country,Active
0,Unknown,-1,NaN,\N,Y
1,Private flight,1,NaN,NaN,Y
2,135 Airways,2,GNL,United States,N
3,1Time Airline,3,RNX,South Africa,Y
4,2 Sqn No 1 Elementary Flying Training School,4,WYT,United Kingdom,N
...,...,...,...,...,...
6157,GX Airlines,21248,CBG,China,Y
6158,Lynx Aviation (L3/SSX),21251,SSX,United States,N
6159,Jetgo Australia,21268,\N,Australia,Y
6160,Air Carnival,21270,\N,India,Y
6161,Svyaz Rossiya,21317,SJM,Russia,Y

In [6]:
# airline_clean_df = airline_clean_df['Country'].replace({'ALASKA': 'United States',
#                                                         'AVIANCA': 'Colombia',
#                                                         'Russia]]': 'Russia'
#                                                         })

In [7]:
crash_file = "Data/Airplane_Crashes_and_Fatalities_Since_1908.csv"
crash_df = pd.read_csv(crash_file)
crash_df.head()

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,7/12/1912,6:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,8/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,9/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...

In [8]:
crash_clean_df = crash_df[["Date", "Location", "Operator", "Type", "Aboard", "Fatalities", "Summary"]].copy()
crash_clean_df["Date"] = pd.to_datetime(crash_clean_df["Date"])
crash_clean_df = crash_clean_df[crash_clean_df["Date"].dt.year >= 1970]

crash_clean_df = crash_clean_df.reset_index()

In [9]:
crash_clean_df[crash_clean_df['Operator'].str.contains('/', na=False)]

,index,Date,Location,Operator,Type,Aboard,Fatalities,Summary
80,2436,1970-11-24,"Nar Can Tho, South Vietnam",Military - Vietnamese Air Force / Military - U...,de Havilland RU-6A Beaver /Bell UH-1H,18.0,18.0,"Mid-air collision at 1,200 ft."
93,2449,1971-01-09,"Edison, New Jersey",American Airlines / Private,Boeing B-707-323 / Cessna 150,21.0,2.0,"Midair collision at 3,000 ft. Failed to see a..."
119,2475,1971-06-06,"Near Duarte, California",Hughes Airwest / Military - US Marine Air Corps,McDonnell Douglas DC-9-31 / F4-B,51.0,50.0,The DC-9 was climbing to FL 330 under radar co...
129,2485,1971-07-30,"Near Morioko, Japan",All Nippon Airways / Japanese Air Force,Boeing B-727-281 / Air Force F86F,164.0,163.0,A Japan Air Self Defense Force F-86F fighter c...
214,2570,1972-06-29,"Appleton, Wisconsin",North Central Airlines / Air Wisconsin,Convair CV-580/De Hav. Twin Otter 100,13.0,13.0,Both aircraft were proceeding under VFR gettin...
222,2578,1972-07-29,"Villavicencio, Colombia",AVIANCA / AVIANCA,Douglas DC-3 / Douglas DC-3,38.0,38.0,Midair collision. Seventeen aboard the HK-134 ...
260,2616,1972-12-20,"Chicago, Illinois",Delta Air Lines/ North Central Airlines,Convair CV-880 / McDonnell DC-9-31,133.0,10.0,"The Delta Convair, taxing across Runway 27L, a..."
286,2642,1973-03-05,"Near Nantes, France",Lineas Aereas de Espana/Spantax SA Transportes,MD Douglas DC-9-32/Convair CV-990A,182.0,68.0,Midair collision. Convair crew improperly asse...
292,2648,1973-04-12,"Sunnyvale, California",Military - U.S. Navy / NASA,Lockheed P-3C / Convair CV-990-30A-5,17.0,16.0,A Navy P-3C collided with a NASA research jet ...
321,2677,1973-09-04,"Gary, Indiana",Aegler Stuart Flying Service / Private,Piper PA-30 / Cessna 337A,5.0,4.0,"The Piper, landing on Runway 20 collilded with..."
439,2795,1975-01-09,"Whittier, California",Golden West Airlines / Private,de Hav Can. DHC-6 Tw Otter 100/ Cessna,14.0,14.0,Midair collision between a DHC-6 and a Cessna ...
567,2923,1976-09-09,"Off Adler, Russia",Aeroflot / Aeroflot,Antonov AN-24 / Yakovlev Yak-40,90.0,90.0,Midair collision at FL187. ATC error. Fifty-t...
568,2924,1976-09-10,"Near Gaj, Hrvatska, Yugoslavia",Inex Adria Aviopromet / British Airways,McDonnell Douglas DC-9-31 / Trident 3B,176.0,176.0,"Midair collision. ATC error, negligence in ope..."
607,2963,1977-03-27,"Tenerife, Canary Islands",Pan American World Airways / KLM,Boeing B-747-121 / Boeing B-747-206B,644.0,583.0,Both aircraft were diverted to Tenerife becaus...
723,3079,1978-09-25,"San Diego, California",PacifiSouthwest Airlines / Private,Boeing B-727-214 / Cessna 172,137.0,137.0,Midair collision. The PSA was descending and a...
802,3158,1979-08-11,"Dneprodzerzhinsk, Ukraine, USSR",Aeroflot / Aeroflot,Tupolev TU-134A / Tupolev Tu-134A,178.0,178.0,"Midair collision at 27,200 ft. Separation erro..."
923,3279,1981-04-17,"Loveland, Colorado",Air US / Private,Hadley Page 137Jetstream I / Cessna 206,19.0,15.0,A midair collision occurred 2 nm east-southeas...
946,3302,1981-08-24,"Near Zavitinsk, Russia",Aeroflot / Military - Russian Air Force,Antonov AN-24RV / Soviet Air Force TU-16,32.0,31.0,Midair collision with a Soviet Air Force TU-16...
949,3305,1981-09-18,"Zeleznogorsk, Russian",Aeroflot /Military - Russian,Yakovlev YAK-40 / Mil Mi-8,33.0,33.0,Midair collision with a military Mi-8 helicopter.
1015,3371,1982-08-14,"Sukhumi, Georgia, USSR",Aeroflot / Aeroflot,LeT 410UVP Turbojet / Tupolev TU-134V,11.0,11.0,Ground collision. Eleven killed on the LET and...
1097,3453,1983-12-07,"Near Madrid, Spain",Iberia Airlines / Aviaco,Boeing B-727-200 / DC9-32,135.0,93.0,"While taking off, the B-727 struck the DC-9 on..."
1123,3479,1984-04-18,"Imperatriz, Brazil",VOTEC / VOTEC,Embraer 110EJ Band./Embraer 110P Band.,35.0,19.0,"Midair collision. Same aircraft type, same ai..."
1143,3499,1984-08-24,"San Luis Obispo, California",Wings West Airlines / Private,Beechcraft C99 / Rockwell 112TC,17.0,17.0,"A head-on midair collision occurred at 3, 400 ..."
1197,3553,1985-05-03,"Near L'vov, Ukraine, USSR",Aeroflot / Soviet Air Force,Tupolev TU-134A / Antonov An-26,76.0,76.0,Midair collision as the Tupolev-134A prepared ...
1271,3627,1986-06-18,"Grand Canyon, Arizona",Grand Canyon Airlines / Helitech,de Havilland Can. DHC-6 -300/ Bell 206B,25.0,25.0,Midair collision. Inadequate visual lookout on...
1282,3638,1986-08-31,"Cerritos, California",Aeromexico / Private,MD Douglas DC-9-32 / Piper PA-28-181,67.0,67.0,"A midair collision occurred between a DC-9, at..."
1310,3666,1987-01-15,"Salt Lake City, Utah",Skywest Airlines / Private.,Swearingen SA-226TC / Mooney M-20C,10.0,10.0,"Midair collision with a Mooney M-20 at 7,000 f..."
1368,3724,1988-01-19,"Bayfield, Colorado",Trans Colorado AL / Continental Express,Swearingen SA.227AC Metro,17.0,9.0,The aircraft crashed while attempting to land ...
1391,3747,1988-02-19,"Cary, North Carolina",AV Air / American Eagle,Swearingen SA227-AC,12.0,12.0,The plane crashed into a reservoir shortly aft...
1457,3813,1988-12-11,"Leninakan, Armenia, USSR",Military - Russian Air Force / Military - Russ...,Ilyushin IL-76 / Mi-8 (helicopter),83.0,77.0,A midair collision occurred between a soviet t...
1544,3900,1989-11-23,Albania,Military - People's Army/ Military - Peoples A...,Mil Mi-4 / Mil Mi-4,24.0,24.0,Two helicopters transporting bus accident vict...
1614,3970,1990-10-02,"Guangzhou, China",China Southwest Airlines / Xiamen Airlines,Boeing B-737-247 / Boeing B-757-21B,226.0,128.0,Shortly after taking off a hijacker entered th...
1625,3981,1990-12-03,"Romulus, Michigan",Northwest Airlines/ Northwest Airlines,Boeing B-727-251 / MD Douglas DC-9-14,198.0,8.0,Ground collision in dense fog. The 727 was on ...
1633,3989,1991-02-01,"LAX, Los Angeles, California",USAir / Skywest Airlilnes,Boeing B-737-300 / Swearingen SA-227AC,99.0,34.0,The Skywest Metroliner was told to taxi into p...
1647,4003,1991-03-21,"Off San Diego, California",Military - U.S. Navy / Military - U.S. Navy,Lockheed P-3C / Lockheed P-3C,27.0,27.0,"The two aircraft collided at an altitude of 3,..."
1795,4151,1992-11-30,"Near Harlem, Montana",Military - U.S. Air Force / Military - U.S. Ai...,Lockheed C-141B / Lockheed C141B,13.0,13.0,The two aircraft on a training mission and ref...
1799,4155,1992-12-22,"Tripoli, Libya",Libya Arab Airlines / Military - Libya Air Force,Boeing B-727-2L5 / MiG23UB,157.0,157.0,Midair collision with an Libyan Air Force figh...
1807,4163,1993-02-08,"Near Tehran, Iran",Iran Air Tours / Military - Iranian Air Force,Tupolev TU-154M / Sukhoi Su-24,133.0,133.0,Midair collision with an Iranian Air Force fig...
1862,4218,1993-12-09,"Off Dakar, Senegal",Air Senegal / Gambia Airways,DHC-6 Twin Otter 300 / NAMC YS-11,3.0,3.0,"Midair collision. The Twin Otter, which was de..."
1886,4242,1994-03-23,"Near Fayetteville, North Carolina",Military - U.S. Air Force / Military U.S. Air ...,GD F-16D / Lockheed C-130E,7.0,0.0,The jet fighter collided in mid air with the t...
1891,4247,1994-04-14,Northern Iraq,Military - U.S. Army / Military U.S. Army,Sikorsky UH-60 / Sikorsky UH-60,26.0,26.0,Shot down by friendly fire during the Gulf War...
1944,4300,1994-11-22,"Bridgeton, Missouri",Trans World Airlines / Private,McDonnell Douglas DC-9-82 / Cessna 441,142.0,2.0,"During its takeoff roll, the DC-9 collided wit..."
1976,4332,1995-05-01,"Sioux Falls, Ontario, Canada",Bearskin Airlines / Air Sandy,Swear. SA-227CC Metro 23/Piper Navajo,8.0,8.0,The SA-227 collided with the Piper PA-31-350 t...
2099,4455,1996-11-12,"Near Charkhidadri, India",Saudi Arabian Airlines / Kazastan Airlines,Boeing B-747-168B / Ilyushin IL-76TD,349.0,349.0,Midair collision 17 km W of New Delhi. The Sa...
2102,4458,1996-11-19,"Quincy, Illinois",United Express / Private,Beechcraft 1900-C / Beech King Air A90,14.0,14.0,"While landing on Runway 13 at Baldwin Field, t..."
2122,4478,1997-02-04,Northern Israel,Military - Israel Air Force /Military - Israe...,Sikorsky CH53D / Sikorsky CH53D,73.0,73.0,The two military helicopters crashed into each...
2161,4517,1997-09-13,"Off Namibia, Africa",Military - Luftwaffe / Military - USAF,Tupolev TU-154M / C-141 Starlifter,33.0,33.0,"Midair collision at 39,000 ft. The Tupolev 154..."
2217,4573,1998-07-30,"Near Quiberon, France",Proteus Air / Private,Beechcraft 1900D / Cessna 177,15.0,15.0,Midair collision. The Beechcraft was on a flig...
2372,4728,2000-07-17,"Patna, India",Indian Airlines/Alliance Airlines,Boeing B-737-2A8 Advanced,58.0,55.0,"While attempting to land at Patna, the aircraf..."
2381,4737,2000-08-09,"Burlington Township, New Jersey",Patuxent Airways / Private,Piper Navajo PA-31/ Piper Seminole PA-44,11.0,11.0,The two aircraft collided over a central New J...
2454,4810,2001-10-08,"Milan, Italy",Scandinavian Airlines (SAS) / Private,MD-87 / Cessna 525A Citation II,114.0,114.0,The aircraft was taking off from Linate Airpor...
2512,4868,2002-07-01,"Uberlingen, Germany",Bashkirian Airlines / DHL Worldwide Express,Tupolev TU-154M / Boeing B-757-23APF,71.0,71.0,The airliner and cargo plane collided over sou...
2552,4908,2003-01-08,"Charlotte, North Carolina",US Air Express/Air Midwest,Beech BE-1900D,21.0,21.0,The commuter plane was not able to maintain al...
2655,5011,2004-10-14,"Jefferson City, Missouri",Pinnacle Airlines/Northwest Airlink,Canadair CRJ200LR RegionalJet,2.0,2.0,"On a night repositioning flight, while en rout..."
2664,5020,2004-11-28,"Montrose, Colorado",Glow Air/Air Castle - Charter,Canadair CL-601-2A12 Challenger,6.0,3.0,"While attempting to take off from R31, the air..."
2764,5120,2006-09-29,"Near Sao Felix do Araguaia , Brazil",Gol Airlines / Private,Boeing B-737-8EH /EMB-135JB,161.0,154.0,The flight disappeared from radar at 16:50 aft...
2766,5122,2006-10-19,"Tashkent, Russia",Military - Russian Air Force/Uzbekistan Airways,Antonov An-2,15.0,15.0,The plane belonging to Uzbekistan Airways and ...
2858,5214,2008-06-29,"Flagstaff, Arizona",Air Methods / ClassiHelicopters,Bell 407 / Bell 407,7.0,6.0,The two helicopters struck each other in mid-a...
2872,5228,2008-09-01,"Near Bukavu, Congo",Air Serv Internatiional/CemAir,Beechcraft 1900C-1,17.0,17.0,"The plane, on a humanitarian flight to Goma, c..."
2892,5248,2009-02-12,"Clarence Center, New York",Continental Connection/Colgan Air,Bombardier DHC-8-402 Q400,49.0,49.0,The commuter plane crashed while attemptiong t...

In [10]:
# crash_clean_df['Operator', 'Type'] = crash_clean_df['Operator', 'Type'].str.split("/") 
# crash_clean_df.explode('Operator', 'Type').reset_index(drop=False)

In [11]:
crash_clean_df.head()

,index,Date,Location,Operator,Type,Aboard,Fatalities,Summary
0,1237,1970-02-13,"Pin-la-Garenne, France",Avia-Taxi,Cessna 402,10.0,10.0,NaN
1,1643,1973-05-11,"Near Semipalatinsk, USSR",Aeroflot,Ilyushin IL-18B,61.0,61.0,NaN
2,1807,1973-10-12,"Acapulco, Mexico",Avionas Banamex,de Havilland DH-125-1A,8.0,8.0,Crashed while approaching to land.
3,1965,1973-10-15,"Fort Smith AFB, Oklahoma",Military - U.S. Air Force,Lockheed C-130E Hercules,7.0,7.0,Crashed into a mountain.
4,2003,1975-07-31,"Santiago, Chili",Military - Chilian Air Force,Douglas C-47,10.0,10.0,NaN

In [12]:
crash_clean_df.iloc[80:100]

,index,Date,Location,Operator,Type,Aboard,Fatalities,Summary
80,2436,1970-11-24,"Nar Can Tho, South Vietnam",Military - Vietnamese Air Force / Military - U...,de Havilland RU-6A Beaver /Bell UH-1H,18.0,18.0,"Mid-air collision at 1,200 ft."
81,2437,1970-11-27,"Anchorage, Alaska",Capital Airlines,McDonnell Douglas DC-8-63CF,229.0,47.0,The military charter overran the runway during...
82,2438,1970-11-27,"Near Nha Trang, South Vietnam",Military - U.S. Air Force,Fairchild C-123K,79.0,79.0,Crashed into high ground on a mountainside whi...
83,2439,1970-11-29,"Near Cam Ranh, South Vietnam",Military - U.S. Air Force,Fairchild C-123K,44.0,42.0,Crashed into the jungle 15 miles from it desti...
84,2440,1970-12-02,"Dhaka, Bangladesh",Cargolux,Canadair CL-44J,4.0,4.0,The cargo plane crashed while attempting to la...
85,2441,1970-12-05,"Delhi, India",Jamair,Douglas DC-3,16.0,5.0,The No. 2 engine failed on takeoff due to fuel...
86,2442,1970-12-07,"Near Constanta, Romania",Tarom,BAC One-Eleven 424EU,27.0,18.0,Crashed 4 kms short of the runway on approach ...
87,2443,1970-12-19,"Panarah, Pakistan",Aeroflot,Antonov AN-22,25.0,25.0,Crashed during an emergency landing with engin...
88,2444,1970-12-28,"St. Thomas, Virgin Islands",Trans Caribbean Airways,Boeing B-727-2A7,55.0,2.0,The aircraft experienced a hard landing which ...
89,2445,1970-12-30,"Near Shemshernagar, Pakistan",Pakistan International Airlines,Fokker F-27 Friendship 200,35.0,7.0,Crashed and burned on landing.
90,2446,1970-12-31,"Off Algiers, Algeria",Rousseau Aviaiton,Nord 262E,31.0,31.0,Ditched in the ocean. Mayday received. No trac...
91,2447,1970-12-31,"Leningrad, Russia",Aeroflot,Ilyushin IL-18B,93.0,93.0,The plane crashed during takeoff on a flight t...
92,2448,1971-01-02,"Ben Gashir, Libya",United Arab Airlines,de Havilland Comet 4C,16.0,16.0,Crashed 7 kms from the runway in a sandstorm. ...
93,2449,1971-01-09,"Edison, New Jersey",American Airlines / Private,Boeing B-707-323 / Cessna 150,21.0,2.0,"Midair collision at 3,000 ft. Failed to see a..."
94,2450,1971-01-18,"Zurich, Switzerland",Balkan Bulgarian Airlines,Ilyushin IL-18,47.0,45.0,The crew decided while on the ground at Paris ...
95,2451,1971-01-21,"Near Privas, France",L'Armée de L'Air,Nord 262A-34,21.0,21.0,Crashed and exploded in a snowstorm in mounta...
96,2452,1971-01-21,"Near Pacae, Peru",Fuerza Aérea del Peru,Curtiss-Wright C-46,35.0,35.0,Crashed in the Andes mountains after experienc...
97,2453,1971-01-22,"Surgut, USSR",Aeroflot,Antonov AN-12,13.0,13.0,Crashed on approach.
98,2454,1988-10-02,"Sao Pedro da Aldeia, Brazil",Aramar,Beech King Air F90,8.0,8.0,NaN
99,2455,1971-01-23,"Near Sokcho, South Korea",Korean Airlines,Fokker F-27 Friendship 500,60.0,2.0,Crash landed on a beach after a hijacker deton...

In [13]:
crash_clean_df = crash_clean_df.replace({'United Air lines': 'United Airlines',
                                         'AVIANCA': 'Avianca',
                                         'Varig': ' Varig Log',
                                         'Compania Dominicana de Aviacion': 'Dominicana de Aviaci',
                                         'Aviogenex (Yugoslavia)': 'Aviogenex',
                                         'Stirling Airways': 'Stirling Airlines',
                                         'Japan Air Lines': 'Japan Airlines',
                                         'Cathay PacifiAirways': 'Cathay Pacific',
                                         'British European Airways': 'British Airways',
                                         'Spantax': 'Spantax S.A.',
                                         'Eastern Air Lines': 'Balitmore Airways',
                                         'Alia Royal Jordanian Airlines': ' Royal Jordanian',
                                         'Libya Arab Airlines': ' Libyan Airlines',
                                         'Turkish Airlines(THY)': 'Turkish Airlines',
                                         'Martinair Holland NV': 'Martinair',
                                         'Ceskoslevenske Aerolinie': 'Czech Airlines',
                                         'Inex Adria Aviopromet': 'Adria Airways',
                                         'TAP (Air Portugal)': 'TAP Portugal',
                                         'Air India': 'Air India Limited',
                                         'Loftledidir IcelandiAirlines': 'Icelandair',
                                         'Iran National Airlines': 'Iran Air',
                                         'Dan Air Services': 'Dan-Air London',
                                         'Korean Airlines': ' Korean Air',
                                         'Arrow Airways': 'Arrow Air',
                                         'Mexicana': 'Mexicana de Aviaci',
                                         'Thai Airways': 'Thai Airways International',
                                         'Tajikistan Airlines': 'Tajikistan International Airlines',
                                         'Cebu PacifiAir': ' Cebu Pacific',
                                         'China Airlines (Taiwan)': 'China Airlines',
                                         'EgyptAir': 'Egyptair',
                                         'Scandinavian Airlines (SAS)': 'Scandinavian Airlines System',
                                         'Flash Air': 'Flash Airlines',
                                         'Subir (S7)': 'S7 Airlines',
                                         'Pulkovo Airlines': 'Rossiya-Russian Airlines',
                                         'TAM (Brazil)': 'TAM Brazilian Airlines',
                                         'One-Two-Go Airlines': 'One Two Go Airlines'})

In [14]:
airline_crash_df = pd.merge(airline_clean_df, crash_clean_df, how='inner', on='Operator')
airline_crash_df

,Operator,Airline ID,ICAO,Country,Active,index,Date,Location,Type,Aboard,Fatalities,Summary
0,Aloha Airlines,22,AAH,United States,Y,3764,1988-04-28,"Maui, Hawaii",Boeing B-737-297,95.0,1.0,The aircraft suffered separation of the top of...
1,American Airlines,24,AAL,United States,Y,2895,1976-04-27,"St. Thomas, Virgin Islands",Boeing B-727-95,88.0,37.0,"After touching down 2,200 feet down the runway..."
2,American Airlines,24,AAL,United States,Y,3137,1979-05-25,"Chicago O'Hare, Illinois",McDonnell Douglas DC-10-10,271.0,271.0,"During takeoff just, as the plane lifted from ..."
3,American Airlines,24,AAL,United States,Y,3182,1979-11-15,"Near Chicago, Illinois",Boeing B-727,78.0,0.0,While en route from Chicago to Washington an e...
4,American Airlines,24,AAL,United States,Y,3549,1985-04-16,"Las Cruces, New Mexico",Boeing B-727-227,89.0,0.0,While cruising at FL 350 a loud noise was hear...
...,...,...,...,...,...,...,...,...,...,...,...,...
871,Spantax S.A.,18140,BXS,Spain,N,2592,1972-09-30,"Madrid, Spain",Douglas C-47B,6.0,1.0,"The student pilot rotated too quickly, the pla..."
872,Spantax S.A.,18140,BXS,Spain,N,2608,1972-12-03,"Tenerife, Canary Islands",Convair CV-990-30A-5 Coronado,155.0,155.0,Reached a height of 300 feet when the plane s...
873,Spantax S.A.,18140,BXS,Spain,N,3237,1980-08-13,"Sa Cabaneta, Spain",Learjet 35A,4.0,4.0,Slamed into a mountain while on approach.
874,Spantax S.A.,18140,BXS,Spain,N,3378,1982-09-13,"Near Malaga, Spain",McDonnell Douglas DC-10-30CF,394.0,50.0,The aircraft crashed during takeoff after inte...
875,Lina Congo,18762,\N,Congo (Brazzaville),N,4082,1992-03-12,"Etsouali, Congo",de Havilland Canada DHC-6 Twin Otter 300,8.0,3.0,Crashed during a severe thunderstorm.

In [15]:
airline_crash_df.drop(columns=['index'])

,Operator,Airline ID,ICAO,Country,Active,Date,Location,Type,Aboard,Fatalities,Summary
0,Aloha Airlines,22,AAH,United States,Y,1988-04-28,"Maui, Hawaii",Boeing B-737-297,95.0,1.0,The aircraft suffered separation of the top of...
1,American Airlines,24,AAL,United States,Y,1976-04-27,"St. Thomas, Virgin Islands",Boeing B-727-95,88.0,37.0,"After touching down 2,200 feet down the runway..."
2,American Airlines,24,AAL,United States,Y,1979-05-25,"Chicago O'Hare, Illinois",McDonnell Douglas DC-10-10,271.0,271.0,"During takeoff just, as the plane lifted from ..."
3,American Airlines,24,AAL,United States,Y,1979-11-15,"Near Chicago, Illinois",Boeing B-727,78.0,0.0,While en route from Chicago to Washington an e...
4,American Airlines,24,AAL,United States,Y,1985-04-16,"Las Cruces, New Mexico",Boeing B-727-227,89.0,0.0,While cruising at FL 350 a loud noise was hear...
...,...,...,...,...,...,...,...,...,...,...,...
871,Spantax S.A.,18140,BXS,Spain,N,1972-09-30,"Madrid, Spain",Douglas C-47B,6.0,1.0,"The student pilot rotated too quickly, the pla..."
872,Spantax S.A.,18140,BXS,Spain,N,1972-12-03,"Tenerife, Canary Islands",Convair CV-990-30A-5 Coronado,155.0,155.0,Reached a height of 300 feet when the plane s...
873,Spantax S.A.,18140,BXS,Spain,N,1980-08-13,"Sa Cabaneta, Spain",Learjet 35A,4.0,4.0,Slamed into a mountain while on approach.
874,Spantax S.A.,18140,BXS,Spain,N,1982-09-13,"Near Malaga, Spain",McDonnell Douglas DC-10-30CF,394.0,50.0,The aircraft crashed during takeoff after inte...
875,Lina Congo,18762,\N,Congo (Brazzaville),N,1992-03-12,"Etsouali, Congo",de Havilland Canada DHC-6 Twin Otter 300,8.0,3.0,Crashed during a severe thunderstorm.

In [17]:
airline_crash_df[airline_crash_df['Operator'] == 'Thai Airways International']

,Operator,Airline ID,ICAO,Country,Active,index,Date,Location,Type,Aboard,Fatalities,Summary
779,Thai Airways International,4940,THA,Thailand,Y,3215,1980-04-27,"Don Muang, Thailand",Hawker Siddeley HS-748-2,53.0,44.0,"The aircraft entered a thunderstorm, was caugh..."
780,Thai Airways International,4940,THA,Thailand,Y,3548,1985-04-15,"Near Phuket, Thailand",Boeing B-737-200,11.0,11.0,The aircraft hit high ground during good weath...
781,Thai Airways International,4940,THA,Thailand,Y,3708,1987-08-31,"Off Ko Phuket, Thiland",Boeing B-737-2P5,83.0,83.0,The aircraft stalled and crashed into the ocea...
782,Thai Airways International,4940,THA,Thailand,Y,4118,1992-07-31,"Near Kathmandu, Nepal",Airbus A310-304,113.0,113.0,After experiencing difficulty in deploying the...
783,Thai Airways International,4940,THA,Thailand,Y,4606,1998-12-11,"Near Surat Thani, Thailand",Airbus A-310-204,146.0,102.0,The plane crashed 2 miles southwest of Surat T...
784,Thai Airways International,4940,THA,Thailand,Y,4773,2001-03-03,"Bangkok, Thailand",Boeing B-737-4D7,5.0,1.0,The aircraft exploded and caught fire 35 minut...